-- ==========================================
-- 题库系统数据库表结构，建表语句（DDL）
-- 不使用外键，所有关联由应用逻辑维护
-- ==========================================

-- ==========================================
-- 插入用户数据sql
-- ==========================================
INSERT INTO user (user_account, user_name, user_real_name, user_password, role, school_id, email)
values ('00003', 'asdwad1', '张小花', '1235123', '0', 2, 'xxxxx@qq.com'),
       ('00004', 'asdwad2', '张大花', 'qwdadw3', '1', 1, 'xxxxx@qq.com'),
       ('00005', 'asdwad3', '王明', '123awda5123', '1', 3, 'xxxxx@qq.com'),
       ('00006', 'asdwad4', '李明', '12351aswae23', '1', 4, 'xxxxx@qq.com'),
       ('00007', 'asdwad5', 'xxx', '123qwd5123', '1', 5, 'xxxxx@qq.com'),
       ('00008', 'asdwad6', 'zzzz', '1qwdq235123', '1', 5, 'xxxxx@qq.com'),
       ('00009', 'asdwad7', 'xxx', '12qwedq35123', '1', 3, 'xxxxx@qq.com');

-- ==========================================
-- 插入学校数据sql
-- ==========================================
INSERT INTO school (school_name) VALUES ('北京师范大学附属实验中学'),
                                        ('中国人民大学附属中学'),
                                        ('北京市第四中学'),
                                        ('北京市第八中学'),
                                        ('北京市第十一中学');

-- ==========================================
-- 插入来源数据sql
-- ==========================================
INSERT INTO source (name, description) VALUES
                                           ('学科网', '来自学科网的优质题目'),
                                           ('北师大附中校本练习', '附中自编资料'),
                                           ('全国中考试题汇编', '各地中考真题'),
                                           ('区教研试题', '来自海淀、朝阳等区的试卷'),
                                           ('名校模考', '来自清北附中等学校的模拟题'),
                                           ('数学竞赛选题', '初中奥数试题'),
                                           ('课本例题拓展', '课本延伸型题目'),
                                           ('同步训练题', '同步作业中精选题'),
                                           ('错题集改编', '教师归纳的易错题型'),
                                           ('教师原创', '附中数学组原创题目');

-- ==========================================
-- 插入年纪数据sql
-- ==========================================
INSERT INTO grade (name, description) VALUES
                                          ('Grade7-FirstTerm', '初一上册'),
                                          ('Grade7-SecondTerm', '初一下册'),
                                          ('Grade8-FirstTerm', '初二上册'),
                                          ('Grade8-SecondTerm', '初二下册'),
                                          ('Grade9-FirstTerm', '初三上册'),
                                          ('Grade9-SecondTerm', '初三下册');

-- ==========================================
-- 插入综合类型数据sql
-- ==========================================
INSERT INTO complexity_type (type_name, description) VALUES
                                                         ('FunctionIntegration', '函数与代数整合'),
                                                         ('GeometryLogic', '几何与逻辑融合'),
                                                         ('StatisticsRealLife', '统计与生活实际结合'),
                                                         ('GraphModeling', '图像与建模应用'),
                                                         ('ProofAndReasoning', '证明与推理'),
                                                         ('InequalityApplication', '不等式的综合应用'),
                                                         ('EquationTransformation', '方程与变换整合'),
                                                         ('SpaceAndShape', '空间与图形的多角度考察'),
                                                         ('MathAndArt', '数学与美术交叉考察'),
                                                         ('CrossDisciplineChallenge', '跨学科挑战性题目');
-- ==========================================
-- 插入核心素养数据sql
-- ==========================================
INSERT INTO core_competency (competency_name, description) VALUES
                                                               ('LogicalThinking', '逻辑思维能力'),
                                                               ('AbstractModeling', '抽象建模能力'),
                                                               ('DataAwareness', '数据意识'),
                                                               ('SpatialImagination', '空间想象力'),
                                                               ('MathematicalExpression', '数学表达能力'),
                                                               ('ProblemSolving', '问题解决能力'),
                                                               ('ComputationalFluency', '计算能力'),
                                                               ('MathematicalAesthetics', '数学美感'),
                                                               ('MathematicalCommunication', '数学交流能力'),
                                                               ('ScientificReasoning', '科学推理能力');

INSERT INTO source (name) values ('福建省泉州晋江市2024-2025学年下学期九年级4月质量测试数学试题'),
                                 ('24-25六年级下·广东汕头·自主招生'),
                                 ('2025年广东省东莞市东莞中学初中部九年级中考数学一模测试卷'),
                                 ('山东省青岛市市南区青岛大学附属中学2024-2025学年七年级上学期小升初分班考试数学试题'),
                                 ('辽宁省大连市甘井子区弘文中学2024-2025学年七年级下学期4月月考数学试题'),
                                 ('广东省汕头市潮阳区贵屿镇多校2024--2025学年下学期八年级数学期中考试卷'),
                                 ('安徽省阜阳市太和县李兴镇奕安学校2024-2025学年八年级上学期第三次月考数学试题'),
                                 ('辽宁省大连市甘井子区弘文中学2024-2025学年七年级下学期4月月考数学试题');


-- ==========================================
-- 插入元信息
-- ==========================================

INSERT INTO question (question_type, simple_question_type, parent_id,grade_id, source_id, difficulty, complexity_type_id, core_competency_id, created_by)
VALUES (0, 0,NULL ,3, 1, 0.94,1,1,1),
       (0, 0, NULL,1, 2, 0.65,2,2,1),
       (0, 2, NULL,3, 3, 0.85,1,2,1),
       (0, 4, NULL,1, 4, 0.85,3,3,1),
       (0, 0, NULL,1, 5, 0.94,4,1,1),
       (0, 2, NULL,2, 6, 0.85,2,3,1),
       (0, 2, NULL,2, 7, 0.65,1,1,1),
       (1, NULL,NULL, 1, 8, 0.65,3,2,1),
       (0, 2,8, 1, 8, 0.65,3,2,1),
       (0, 3,8, 1, 8, 0.65,3,2,1),
       (1, NULL,NULL, 2, 7, 0.65,2,1,1),
       (1, NULL,NULL,2, 7, 0.65,4,2,1);


-- ==========================================
-- 插入题干信息
-- ==========================================
-- 插入题干文本
INSERT INTO question_stem_block (question_id, content_type, text_content, image_file_id, position)
VALUES (1, 0, '下列为负数的是（     ）', NULL, 0),
       (2, 0, '端午节到来之际，甲、乙、丙三个超市都进行促销活动，同一品牌原件20元一袋的八宝糯米粽子，甲超市每袋降价，乙超市买三送一，丙超市每袋打八折出售，妈妈要买4袋粽子，去（            ）超市购买更省钱．', NULL, 0),
       (3, 0, '若式子\sqrt{2x+3}在实数范围内有意义，则的取值范围是_____．', NULL, 0),
       (4, 0, '1.某商店同时卖出两件商品，每件各卖得60元，但其中一件赚了，另一件赔了．该商店卖出这两件商品一共赔了5元．(        )', NULL, 0),
       (5, 0, '1.如图，直径为1个单位长度的圆从原点沿数轴向右滚动一周，圆上的一点由原点到达0，点0对应的数是（)', NULL, 0),
       (5, 1, NULL, 1, 50),
       (6, 0, '5.如图所示的赵爽弦图是由四个全等的直角三角形和一个小正方形拼成的一个大正方形，大正方形的面积为41，小正方形的面积为1，设直角,较长直角边长为b,则a+b的值为', NULL, 0),
       (6, 1, NULL, 2, 81),
       (7, 0, '8.现有3张4卡片、10张B卡片、8张C卡片，A,B,C卡片的边长(b>a)如图所示，从这三种卡片中抽取若干张（每种卡片至少取一张），使其紧密地拼接成一个几何图形甲.(1)若甲为正方形，且边长为(a+2b),则取了张C卡片___；(2)若甲为长方形，且面积为2+nab+852,则满足条件的整数的值为___', NULL, 0),
       (7, 1, NULL, 3, 154),
       (8, 0, '10.据说．我国著名数学家华罗庚在一次出国访问途中，看到飞机上邻座的乘客阅读的杂志上有一道智力题：一个数是59319，希望求它的立方根．华罗庚脱口而出：39．邻座的乘客十分惊讶，忙问计算的奥秘．你知道华罗庚怎样迅速准确地计算出来的吗？请按照下面的问题试一试：', NULL, 0),
       (9, 0, '由10^3=1000,100^3=1000000，可以确定59319是___位数，由59319的个位上的数是____，可以确定V59319的个位上的数字是____,如果划去59319后面的三位319得到数59，而33=27,43=64，由此可以确定/59319的十位上的数字是___', NULL, 0),
       (10, 0, '已知一274625是整数的立方，按照上述方法，请你求它的立方根.', NULL, 0);



-- 插入题干图像
INSERT INTO image_file (image_url, uploaded_by) VALUES ('https://img.xkw.com/dksih/QBM/editorImg/2025/4/16/16938cb7-1074-4eda-b267-0003c95f0f5a.png',1),
                                                       ('https://img.xkw.com/dksih/QBM/editorImg/2025/4/16/acf1ca76-2c3b-49d1-820e-7665742a7312.png',1),
                                                       ('https://img.xkw.com/dksih/QBM/editorImg/2025/4/16/acf1ca76-2c3b-49d1-820e-7665742a7312.png',1);



-- ==========================================
-- 插入答案信息
-- ==========================================
INSERT INTO question_answer_block (question_id, content_type, image_file_id, interactive_index, answer_text, position)
VALUES (1, 0, NULL, 1, 'C',0),
       (2, 0, NULL, 1, 'B',0),
       (3, 0, NULL, 1, 'x >= -3/2',0),
       (4, 0, NULL, 1, '√',0),
       (5, 0, NULL, 1, 'B',0),
       (6, 0, NULL, 1, '9',0),
       (7, 0, NULL, 1, '4',0),
       (7, 0, NULL, 2, '6',1),
       (9, 0, NULL, 1, '两',0),
       (9, 0, NULL, 2, '9',1),
       (9, 0, NULL, 3, '3',2),
       (10, 0, NULL, 1, '-65',0);



-- ==========================================
-- 插入解析-分析信息
-- ==========================================
INSERT INTO question_explanation_block (question_id, explanation_type, content_type, image_file_id, explanation_text, interactive_index,position)
VALUES (1, 0,0,NULL,'本题考查了对正数、负数的理解，注意0既不是正数也不是负数.根据正数大于0，负数小于0即可得出的答案.',1,0),
       (2, 0,0,NULL,'本题考查了有理数混合运算的应用，有理数大小比较，分别计算出三个超市优惠后的价格，进行比较法解决问题即可',1,0),
       (3, 0,0,NULL,'本题考查了二次根式有意义的条件，结合被开方数为非负数进行列式计算，即可作答',1,0),
       (4, 0,0,NULL,'本题主要考查有理数混合运算的应用，熟练掌握有理数的混合运算是解题的关键.根据题意可求出每件的进价，然后再进行求解即可',0,0),
       (5, 0,0,NULL,'本题主要考查了实数与数轴，用原点表示的数幼加上圆的周长即可得到答案',1,0),
       (6, 0,0,NULL,'本题考查了勾股定理和完全平方公式的应用.结合题意，表示出2+b2=41,(b-a)2-=a2-2ab+b2-1,求出2ab=40,然后利用(a+b)2=a2+2ab+b2=41+40=81,进而求解即可.',1,0),
       (7, 0,0,NULL,'(1)由正方形的面积得(a+2b)2,即可求解；',1,0),
       (7, 0,0,NULL,'(2)由(a+2b)(a+4b),即可求解',2,24),
       (9, 0,0,NULL,'(1)按照求立方根三步走，求位数，求个位，求十位推算即可',1,0),
       (10, 0,0,NULL,'(2)按照题给方法，依次推算即可：',1,0);


-- ==========================================
-- 插入解析-详解信息
-- ==========================================
INSERT INTO question_explanation_block (question_id, explanation_type, content_type, image_file_id, explanation_text, interactive_index,position)
VALUES (1, 1,0,NULL,'解：A.$0$不是负数，故此选项不符合题意；B.$3.14>0$,是正数，故此选项不符合题意；C.$一1<0$，故此选项符合题意；D.$2>0$是正数，故此选项不符合题意；故选：C.',1,0),
       (2, 1,0,NULL,'解：20×4=80（元）甲超市优惠后价格：80×(1-15%)=80×85%=68(元)，乙超市优惠后价格：20×(4-1)=60(元)丙超市优惠后价格：80×80%=64（元）68>64>60,则从乙超市购买最省钱，故选：B.',1,0),
       (3, 1,0,NULL,'解：式子√2x+3在实数范围内有意义，2x+3≥0解得x≥-3/2,多故答案为：x≥-3/2',1,0),
       (4, 1,0,NULL,'解：其中一件的进价为：60÷（1+20%)=50（元），另一件的进价为：60÷(1-20%)=75（元），∴.60×2-75-50=-5（元），∵此商店赔5元：故答案为：√·',1,0),
       (5, 1,0,NULL,'由题意得，点O对应的数是0+1×π=π，故选：B',1,0),
       (6, 1,0,NULL,'解：，大正方形的面积为41，小正方形的面积为1，a2+b2=41,(b-a)2=a2-2ab+b2=1.41-2ab=12ab=40∴(a+b)2=a2+2ab+b2=41+40=81+b=9(负值舍去)故答案为：9.',1,0),
       (7, 1,0,NULL,'(1)正方形的面积为：(a+2b)2=a2+4ab+4b2C卡片的面积为ab,.取了4张C卡片，故答案为：4；',1,0),
       (7, 1,0,NULL,'(2)解：大正方形的面积为41，小正方形的面积为1，a2+b2=41,(b-a)2=a2-2ab+b2=1.41-2ab=12ab=40∴(a+b)2=a2+2ab+b2=41+40=81+b=9(负值舍去)故答案为：9.',2,55),
       (9, 1,0,NULL,'(1)解：103=1000,1003=1000000，59319是两位数，59319的个位上的数是9,59319的个位上的数字是9，.划去59319后面的三位319得到数59,33=27,43=64V59319的十位上的数字是3故答案是：两，9,3；',1,0),
       (10, 1,0,NULL,'(2)解：1000<274625<1000000.10<V27645<100274625的立方根是两位数274625个位数是5.274625的立方根个位数是5.划去274625后面的三位625得到数274，且63<274<73,∵274625的立方根的十位数是6，.274625的立方根65，.-274625的立方根是-65.',1,0);


-- ==========================================
-- 插入简单题-选择题,选项信息
-- ==========================================
INSERT INTO question_option (question_id, label, content, image_file_ids, image_positions)
VALUES (1, 'A', '0', NULL, '[]'),
       (1, 'B', '3.14', NULL, '[]'),
       (1, 'C', '-1', NULL, '[]'),
       (1, 'D', '\sqrt{2}', NULL, '[]'),
       (2, 'A', '甲', NULL, '[]'),
       (2, 'B', '乙', NULL, '[]'),
       (2, 'C', '丙', NULL, '[]'),
       (2, 'D', '都一样', NULL, '[]'),
       (5, 'A', '3.14', NULL, '[]'),
       (5, 'B', 'Π', NULL, '[]'),
       (5, 'C', '-Π', NULL, '[]'),
       (5, 'D', '1', NULL, '[]');


-- ==========================================
-- 插入题目-知识点关联数据
-- ==========================================

INSERT INTO question_knowledge (question_id, knowledge_point_id) VALUES (1, 4700),
                                                                        (1, 4694),
                                                                        (1, 4687),
                                                                        (1, 4678),

                                                                        (2, 4723),
                                                                        (2, 4699),
                                                                        (2, 4687),
                                                                        (2, 4678),

                                                                        (2, 4760),
                                                                        (2, 4744),
                                                                        (2, 4726),
                                                                        (2, 4688),
                                                                        (2, 4678),

                                                                        (3, 4964),
                                                                        (3, 4959),
                                                                        (3, 4693),
                                                                        (3, 4678),

                                                                        (4, 4760),
                                                                        (4, 4744),
                                                                        (4, 4726),
                                                                        (4, 4688),
                                                                        (4, 4678),

                                                                        (5, 4796),
                                                                        (5, 4771),
                                                                        (5, 4689),
                                                                        (5, 4678),

                                                                        (6, 5510),
                                                                        (6, 5499),
                                                                        (6, 5393),
                                                                        (6, 5273),
                                                                        (6, 4681),

                                                                        (6, 4895),
                                                                        (6, 4813),
                                                                        (6, 4690),
                                                                        (6, 4678),

                                                                        (7, 4895),
                                                                        (7, 4813),
                                                                        (7, 4690),
                                                                        (7, 4678),

                                                                        (7, 4883),
                                                                        (7, 4859),
                                                                        (7, 4812),
                                                                        (7, 4690),
                                                                        (7, 4678),

                                                                        (8, 4883),
                                                                        (8, 4859),
                                                                        (8, 4812),
                                                                        (8, 4690),
                                                                        (8, 4678);

